docs/notes/future_simulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-12 Thu 13:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">future simulation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="future">future</span>&#xa0;<span class="optimization">optimization</span></span></a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">future simulation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="future">future</span>&#xa0;<span class="optimization">optimization</span></span></h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2017-09-19 Tue&gt; </span></span> - <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-10-01 Sun&gt;</span></span>
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> buy and hold mode on future backtesting.</li>

<li class="on"><code>[X]</code> revise pnl fitness function, rename previous pnlfitness function name to PnLAndHoldingFitness, create another two seperate functions PnLFitness and HoldingFitness respectively.</li>

<li class="on"><code>[X]</code> export data from database.</li>
<li class="on"><code>[X]</code> roll over between two contracts to get continious contract data.</li>

<li class="on"><code>[X]</code> create rolling strategy, return rolling position.</li>

<li class="on"><code>[X]</code> create continuous contracts.</li>

<li class="on"><code>[X]</code> learn function define, function sampling instance, wants, search strategy run on GS.</li>
<li class="on"><code>[X]</code> add trading volume and other value to the continuous contract.</li>
<li class="on"><code>[X]</code> remove unnecessary input of the parsing function.</li>

<li class="on"><code>[X]</code> learn creating function sampleing.</li>

<li class="on"><code>[X]</code> create long/short strategy, return neutral position.</li>
<li class="off"><code>[&#xa0;]</code> deploy portfolio optimization on function sampling workflow.</li>
<li class="off"><code>[&#xa0;]</code> create position signal via continous contract data.</li>
<li class="off"><code>[&#xa0;]</code> to get actual position from simulation position.</li>

<li class="off"><code>[&#xa0;]</code> calculate PnL using future rollover position, long/short position, continuous position.</li>

<li class="off"><code>[&#xa0;]</code> modify simulation code referred to stocks simulation.</li>
<li class="off"><code>[&#xa0;]</code> adjust input signatures.</li>
<li class="off"><code>[&#xa0;]</code> future simulation requested function:</li>
<li>calendar spread trading.</li>
</ul>
<p>
buy current month expired contract.
short next month expired contract.
</p>

<ul class="org-ul">
<li>rolling on constant maturity.</li>

<li>trend following on dominant contract.</li>
</ul>
<p>
moving average crossing over on the continous contract.
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> future simulation pseudo code.</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">def</span> <span style="color: #A6E22E;">OnData</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,<span style="color: #F92672;">slice</span><span style="color: #AE81FF;">)</span>:
       <span style="color: #F92672;">if</span> <span style="color: #F92672;">not</span> <span style="color: #F92672;">self</span>.Portfolio.Invested:
           <span style="color: #F92672;">for</span> chain <span style="color: #F92672;">in</span> <span style="color: #F92672;">slice</span>.FutureChains:
                <span style="color: #75715E;"># </span><span style="color: #75715E;">Get contracts expiring no earlier than in 90 days</span>
               <span style="color: #FD971F;">contracts</span> = <span style="color: #F92672;">filter</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">lambda</span> x: x.Expiry &gt; <span style="color: #F92672;">self</span>.Time + timedelta<span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">90</span><span style="color: #66D9EF;">)</span>, chain.Value<span style="color: #AE81FF;">)</span>

               <span style="color: #75715E;"># </span><span style="color: #75715E;">if there is any contract, trade the front contract</span>
               <span style="color: #F92672;">if</span> <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>contracts<span style="color: #AE81FF;">)</span> == <span style="color: #AE81FF;">0</span>: <span style="color: #F92672;">continue</span>
               <span style="color: #FD971F;">front</span> = <span style="color: #F92672;">sorted</span><span style="color: #AE81FF;">(</span>contracts, key = <span style="color: #F92672;">lambda</span> x: x.Expiry, reverse=<span style="color: #AE81FF;">True</span><span style="color: #AE81FF;">)[</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">]</span>
               <span style="color: #F92672;">self</span>.MarketOrder<span style="color: #AE81FF;">(</span>front.Symbol , <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
       <span style="color: #F92672;">else</span>:
           <span style="color: #F92672;">self</span>.Liquidate<span style="color: #AE81FF;">()</span>
</pre>
</div>
<p>
requested function:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> calendar spread trading.</li>
</ul>

<p>
calculate the position value based on continious contract and actual contract
</p>

<p>
buy current month expired contract.
short next month expired contract.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> rolling on constant maturity.</li>
</ul>

<p>
calculate the position value based on continious contract and actual contract
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> trend following on dominant contract.</li>
</ul>

<p>
moving average crossing over on the continous contract.
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> range osets.</li>
<li class="on"><code>[X]</code> parse future continious contract data.</li>
<li class="off"><code>[&#xa0;]</code> simple mode test with real data.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
